/*4.	Дан массив целых чисел из N элементов. Отсортировать элементы 
со значением больше 10 в порядке возрастания, а остальные  - в порядке 
убывания. Использовать сортировку простыми обменами. */

#include <iostream>

using namespace std;

int main()
{
	int n;
	int m[20];
	cin >> n;
	for (int i = 0; i < n; i++)
	{
		cin >> m[i];
	}
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			if (m[i] > 10 && m[j] > 10)
			{
					if (m[i] < m[j])
					{
						swap(m[i], m[j]);
					}
			}
			
			if (m[i] <= 10 && m[j] <= 10)
			{
				if (m[i] > m[j])
				{
					swap(m[i], m[j]);
				}
			}
		}
	}
	cout << endl;
	for (int i = 0; i < n; i++)
	{
		cout << m[i] << " ";
	}
}

/*
8
2
28
5
13
3
45
10
1

10 13 5 28 3 45 2 1
*/

/*
10
2
54
12
1
198
5
11
8
2
14

8 11 12 5 14 2 54 2 1 198
*/
